# model structure designed for baby detection (fast, big_object)

# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [55,72,  225,304,  438,553]  # P4/16

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [24, 3, 2]], # 1/2
   [-1, 1, Conv, [24, 3, 2]], # 1/4
   [-1, 2, BlazeBlock, [24]],
   [-1, 1, BlazeBlock, [48, None, 2]], # 1/8
   [-1, 2, BlazeBlock, [48]], #
   [-1, 1, DoubleBlazeBlock, [96, 24, 2]], # 1/16
   [-1, 2, DoubleBlazeBlock, [96, 24]], #

  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [48, 1, 1]],  #
   [[-1], 1, Detect, [nc, anchors]],
  ]

